In [1]:
                #Logistic regression

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
data=pd.read_csv("C:\\Users\\user\\Downloads\\User_Data.csv")

In [3]:
data

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [4]:
data=data.iloc[:,1:5]

In [5]:
df=data #dependent values
df

     Gender  Age  EstimatedSalary  Purchased
0      Male   19            19000          0
1      Male   35            20000          0
2    Female   26            43000          0
3    Female   27            57000          0
4      Male   19            76000          0
..      ...  ...              ...        ...
395  Female   46            41000          1
396    Male   51            23000          1
397  Female   50            20000          1
398    Male   36            33000          0
399  Female   49            36000          1

[400 rows x 4 columns]

In [6]:
df=pd.get_dummies(data=data,columns=["Gender"]) #to get dummy values

In [7]:
X=df.drop("Purchased",axis=1)

In [8]:
X

     Age  EstimatedSalary  Gender_Female  Gender_Male
0     19            19000              0            1
1     35            20000              0            1
2     26            43000              1            0
3     27            57000              1            0
4     19            76000              0            1
..   ...              ...            ...          ...
395   46            41000              1            0
396   51            23000              0            1
397   50            20000              1            0
398   36            33000              0            1
399   49            36000              1            0

[400 rows x 4 columns]

In [9]:
y=df["Purchased"]
y #independent value

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [10]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=0)

In [11]:
from sklearn.preprocessing import StandardScaler #it is a class,it scale value into a range like age has 2 digits and salary is 5 digit number..so trying to make it into a same range.

In [12]:
sc=StandardScaler()

In [13]:
X_train=sc.fit_transform(X_train)

In [14]:
X_train

array([[ 1.92295008,  2.14601566, -1.02532046,  1.02532046],
       [ 2.02016082,  0.3787193 ,  0.97530483, -0.97530483],
       [-1.3822153 , -0.4324987 ,  0.97530483, -0.97530483],
       ...,
       [-0.21568634, -0.51941492, -1.02532046,  1.02532046],
       [-1.09058306, -0.46147078,  0.97530483, -0.97530483],
       [-1.18779381,  1.3927418 ,  0.97530483, -0.97530483]])

In [15]:
X_test=sc.fit_transform(X_test)

In [16]:
from sklearn.linear_model import LogisticRegression

In [17]:
lg=LogisticRegression()

In [18]:
lg.fit(X_train,y_train)

LogisticRegression()

In [19]:
y_pred=lg.predict(X_test)

In [20]:
y_pred

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1], dtype=int64)

In [21]:
#0 means not purchased, 1 means purchased

In [22]:
lg.predict([[19,19000,0,1]]) #first row in X

array([1], dtype=int64)

In [23]:
#output as 1 ,so male with age with 19 and 19000 salary will purchase it

In [28]:
from sklearn.metrics import confusion_matrix
confusion_matrix(y_pred,y_test) #creating matrix for predicted values vs actual values

array([[52,  3],
       [ 6, 19]], dtype=int64)

In [ ]:
accuracy=(52+19)/(52+19+3+6) #sum of correct prediction/sum of total prediction
accuracy

In [ ]:
from sklearn import metrics
metrics.accuracy_score(y_test,y_pred)